tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "pingcap/brew"
tap "teamookla/speedtest"
# Record and share terminal sessions
brew "asciinema"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Statistics utility to count lines of code
brew "cloc"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Lint your Python code for style and logical errors
brew "flake8"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# HTTP/2 C Library
brew "nghttp2"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql-client"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql", restart_service: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# JavaScript package manager
brew "yarn"
# Disk Usage/Free Utility
brew "muesli/tap/duf"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
cask "adguard"
cask "adobe-acrobat-pro"
cask "adoptopenjdk"
cask "appcleaner"
cask "baidunetdisk"
cask "balenaetcher"
cask "bob"
cask "camo-studio"
cask "charles"
cask "cheatsheet"
cask "chromedriver"
cask "dash"
cask "datagrip"
cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "elpass"
cask "fantastical"
cask "figma"
cask "fork"
cask "gitkraken"
cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "grammarly"
cask "hackintool"
cask "iina"
cask "intel-power-gadget"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "kindle"
cask "microsoft-auto-update"
cask "notion"
cask "obs"
cask "postman"
cask "pycharm"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qq"
cask "setapp"
cask "skype"
cask "slack"
cask "snipaste"
cask "spotify"
cask "stats"
cask "sunloginclient"
cask "teamspeak-client"
cask "teamviewer"
cask "telegram-desktop"
cask "tencent-meeting"
cask "tuxera-ntfs"
cask "typora"
cask "visual-studio-code"
cask "vnc-viewer"
cask "webstorm"
cask "wechat"
cask "zoom"
cask "zotero"
