tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "pingcap/brew"
tap "teamookla/speedtest"
# Record and share terminal sessions
brew "asciinema"
# Statistics utility to count lines of code
brew "cloc"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Modern replacement for 'ls'
brew "exa"
# Lint your Python code for style and logical errors
brew "flake8"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node@12"
# Python dependency management tool
brew "pipenv"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Messaging broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Disk Usage/Free Utility
brew "muesli/tap/duf"
# TiDB is a MySQL compatible distributed database
brew "pingcap/brew/tidb-server"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
cask "adguard"
cask "adobe-acrobat-pro"
cask "adoptopenjdk"
cask "appcleaner"
cask "baidunetdisk"
cask "balenaetcher"
cask "charles"
cask "cheatsheet"
cask "clash-for-windows"
cask "dash"
cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "elpass"
cask "fantastical"
cask "figma"
cask "free-download-manager"
cask "gitkraken"
cask "goland"
cask "google-chrome"
cask "grammarly"
cask "hackintool"
cask "iina"
cask "intel-power-gadget"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "microsoft-auto-update"
cask "notion"
cask "obs"
cask "postman"
cask "pycharm"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qq"
cask "setapp"
cask "skype"
cask "spotify"
cask "steam"
cask "teamspeak-client"
cask "teamviewer"
cask "telegram-desktop"
cask "tencent-meeting"
cask "typora"
cask "upic"
cask "visual-studio-code"
cask "vnc-viewer"
cask "webstorm"
cask "wechat"
cask "xmind"
cask "zoomus"
cask "zotero"
mas "Disk Speed Test", id: 425264550
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "MoneyWiz", id: 1511185140
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1449412482
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
